Read the following data into a pandas data frame ftp://aftp.cmdl.noaa.gov/products/trends/co2/co2_mm_mlo.txt

Select columns 0,1,3 [[0, 1, 3]]

Use a for loop to find all rows where Co2 (column 3) enteries with the value -99.99 (these are missing values) and replace them with NaN values (try using np.nan - do you know what it is? )

Change names of columns to year, month, and CO2 (use colnames)

Add a column 'Day' and specifiy the day 15 for all enteries

Add a date column according to the 'year', 'month' and 'day' columns (options: use apply with lambda or for loop together with datetime.date (make sure to import it))

Drop the 'Day' column

In [47]:
import pandas as pd
import numpy as np
import datetime

In [40]:
df = pd.read_csv('ftp://aftp.cmdl.noaa.gov/products/trends/co2/co2_mm_mlo.txt', 
                 usecols=[0,1,3],
                 comment='#', 
                 delim_whitespace=True,
                 header=None)

In [41]:
#df.columns = ['year', 'month', 'decimal_date', 'average', 'interpolated_season_corr', 'trend', 'num_days']
df.columns = ['year', 'month', 'CO2']

In [42]:
df.head(2)

   year  month     CO2
0  1958      3  315.71
1  1958      4  317.45

In [43]:
df.CO2 = df.CO2.apply(lambda x: np.nan if x == -99.99 else x)

In [45]:
df['day'] = 15

In [66]:
df.head(2)

   year  month     CO2  day       date
0  1958      3  315.71   15 1958-03-15
1  1958      4  317.45   15 1958-04-15

In [58]:
df['date'] = pd.to_datetime(df.year*10000+df.month*100+df.day, format='%Y%m%d')

In [67]:
df['date'] = pd.to_datetime(dict(year=df.year, month=df.month, day=df.day))

In [68]:
df.head(2)

   year  month     CO2  day       date
0  1958      3  315.71   15 1958-03-15
1  1958      4  317.45   15 1958-04-15

In [69]:
df.drop(columns='day', inplace=True)

In [70]:
df.head(2)

   year  month     CO2       date
0  1958      3  315.71 1958-03-15
1  1958      4  317.45 1958-04-15

In [71]:
[15]*10

[15, 15, 15, 15, 15, 15, 15, 15, 15, 15]

In [73]:
#pd.to_datetime(dict(year=df.year, month=df.month, day=[15]*len(df)))

0     1958-03-15
1     1958-04-15
2     1958-05-15
3     1958-06-15
4     1958-07-15
5     1958-08-15
6     1958-09-15
7     1958-10-15
8     1958-11-15
9     1958-12-15
10    1959-01-15
11    1959-02-15
12    1959-03-15
13    1959-04-15
14    1959-05-15
15    1959-06-15
16    1959-07-15
17    1959-08-15
18    1959-09-15
19    1959-10-15
20    1959-11-15
21    1959-12-15
22    1960-01-15
23    1960-02-15
24    1960-03-15
25    1960-04-15
26    1960-05-15
27    1960-06-15
28    1960-07-15
29    1960-08-15
         ...
706   2017-01-15
707   2017-02-15
708   2017-03-15
709   2017-04-15
710   2017-05-15
711   2017-06-15
712   2017-07-15
713   2017-08-15
714   2017-09-15
715   2017-10-15
716   2017-11-15
717   2017-12-15
718   2018-01-15
719   2018-02-15
720   2018-03-15
721   2018-04-15
722   2018-05-15
723   2018-06-15
724   2018-07-15
725   2018-08-15
726   2018-09-15
727   2018-10-15
728   2018-11-15
729   2018-12-15
730   2019-01-15
731   2019-02-15
732   2019-03-15
733   2019-04-15
734   2019-05-15
735   2019-06-15
Length: 736, dtype: datetime64[ns]